# 1. Mongo Connection

Establecemos la conexión con mongo que a través del enlace del .env que se encuentra en el visual studio code. Con load_dotenv() nos aseguramos que efectivamente existe ese archivo, así que por ahora todo bien.

In [3]:
mongodb+srv://{user}:{password}@cluster0.kf98ps2.mongodb.net/test

SyntaxError: invalid syntax (1193530410.py, line 1)

In [4]:
from pymongo import MongoClient
import os
from dotenv import load_dotenv
load_dotenv()

True

In [5]:
url=os.getenv("url")

In [6]:
client = MongoClient(url)

In [7]:
db = client.get_database("BCN_data")

# 2. Limpieza datos usando pandas

In [8]:
import pandas as pd

## 2.1. Population

#### Cargar los datos
A continuación cargamos los datos de population y comprobamos que podemos acceder correctamente a ellos.

In [33]:
population = db["Population"]

In [10]:
df_pop = pd.read_csv("../data/population.csv")

In [12]:
df_pop.head()

,Year,District.Code,District.Name,Neighborhood.Code,Neighborhood.Name,Gender,Age,Number
0,2017,1,Ciutat Vella,1,el Raval,Male,0-4,224
1,2017,1,Ciutat Vella,2,el Barri Gòtic,Male,0-4,50
2,2017,1,Ciutat Vella,3,la Barceloneta,Male,0-4,43
3,2017,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Male,0-4,95
4,2017,2,Eixample,5,el Fort Pienc,Male,0-4,124

#### Análisis exploratorio
Ahora vemos las características de los datos. En primer lugar, la info de las filas y columnas

In [13]:
df_pop.shape

(70080, 8)

In [14]:
df_pop.dtypes

Year                  int64
District.Code         int64
District.Name        object
Neighborhood.Code     int64
Neighborhood.Name    object
Gender               object
Age                  object
Number                int64
dtype: object

Vemos si hay datos duplicados y los eliminamos

In [15]:
df_pop.duplicated().sum()

4277

In [38]:
#eliminamos los duplicados
df_pop = df_pop.drop_duplicates()

In [39]:
df_pop.duplicated().sum()

0

Vemos si hay datos nulos

In [40]:
df_pop.isna().sum()

Year                 0
District.Code        0
District.Name        0
Neighborhood.Code    0
Neighborhood.Name    0
Gender               0
Age                  0
Number               0
dtype: int64

Vemos los datos de las columnas categóricas, que son las que más nos interesan para el análisis

In [41]:
df_pop.describe(exclude = "number")

       District.Name               Neighborhood.Name  Gender    Age
count          65803                           65803   65803  65803
unique            10                              73       2     20
top       Nou Barris  la Nova Esquerra de l'Eixample  Female  70-74
freq           11410                             944   33039   3481

In [42]:
df_pop["District.Name"].value_counts()

Nou Barris             11410
Horta-Guinardó          9667
Sant Martí              9177
Sants-Montjuïc          7190
Sant Andreu             6285
Eixample                5613
Sarrià-Sant Gervasi     5459
Gràcia                  4573
Ciutat Vella            3656
Les Corts               2773
Name: District.Name, dtype: int64

In [43]:
df_pop["Neighborhood.Name"].value_counts()

la Nova Esquerra de l'Eixample    944
la Dreta de l'Eixample            943
Sant Andreu                       942
la Sagrada Família                938
el Guinardó                       938
                                 ...
Baró de Viver                     793
Torre Baró                        785
Vallbona                          762
la Marina del Prat Vermell        748
la Clota                          661
Name: Neighborhood.Name, Length: 73, dtype: int64

In [44]:
df_pop["Gender"].value_counts()

Female    33039
Male      32764
Name: Gender, dtype: int64

In [45]:
df_pop["Age"].value_counts()

70-74    3481
30-34    3476
25-29    3468
40-44    3463
45-49    3457
50-54    3456
55-59    3449
35-39    3447
75-79    3444
60-64    3439
20-24    3431
80-84    3425
65-69    3423
0-4      3418
85-89    3408
5-9      3386
15-19    3386
10-14    3368
90-94    3248
>=95      730
Name: Age, dtype: int64

Vemos también la información de las columnas numéricas, sobre todo para ver los datos de 'year' y 'number'.

In [46]:
df_pop.describe()

               Year  District.Code  Neighborhood.Code        Number
count  65803.000000   65803.000000       65803.000000  65803.000000
mean    2015.002796       6.224048          36.837409    117.971734
std        1.414855       2.805374          21.177967     96.920441
min     2013.000000       1.000000           1.000000      0.000000
25%     2014.000000       3.000000          18.000000     46.000000
50%     2015.000000       7.000000          37.000000     95.000000
75%     2016.000000       8.000000          55.000000    166.000000
max     2017.000000      10.000000          73.000000    777.000000

In [47]:
df_pop["Year"].value_counts()

2017    13213
2016    13177
2014    13143
2013    13138
2015    13132
Name: Year, dtype: int64

#### Unificar filas
Ahora vamos a unificar los datos de las filas que están separadas por criterios que no nos interesan en este caso, como el género y la edad. Lo que nos interesa es saber cuántas personas hay en cada barrio independientemente de su género y edad, teniendo en cuenta solamente el año 2017 (por ahora). Para eso vamos a hacer una lista con cada uno de los barrios, los iremos buscando uno a uno (iterando) llamando a su 'Number' (la cantidad de personas) y haremos una suma del 'Number' de cada barrio para tener el total.

In [53]:
#prueba solo con El Raval
project = {"Number": 1, "_id": 0}
gente_del_raval = list(population.find({"Neighborhood.Name": "el Raval", "Year": "2017"}, project))

In [58]:
gente_del_raval
#iterar sobre las values de cada diccionario de la lista

[{'Number': '224'},
 {'Number': '216'},
 {'Number': '213'},
 {'Number': '198'},
 {'Number': '235'},
 {'Number': '242'},
 {'Number': '248'},
 {'Number': '222'},
 {'Number': '233'},
 {'Number': '197'},
 {'Number': '206'},
 {'Number': '206'},
 {'Number': '194'},
 {'Number': '179'},
 {'Number': '190'},
 {'Number': '194'},
 {'Number': '194'},
 {'Number': '210'},
 {'Number': '197'},
 {'Number': '237'},
 {'Number': '259'},
 {'Number': '263'},
 {'Number': '328'},
 {'Number': '370'},
 {'Number': '431'},
 {'Number': '453'},
 {'Number': '563'},
 {'Number': '595'},
 {'Number': '559'},
 {'Number': '608'},
 {'Number': '579'},
 {'Number': '562'},
 {'Number': '601'},
 {'Number': '589'},
 {'Number': '649'},
 {'Number': '629'},
 {'Number': '639'},
 {'Number': '645'},
 {'Number': '659'},
 {'Number': '607'},
 {'Number': '556'},
 {'Number': '579'},
 {'Number': '555'},
 {'Number': '490'},
 {'Number': '506'},
 {'Number': '450'},
 {'Number': '456'},
 {'Number': '461'},
 {'Number': '422'},
 {'Number': '373'},
 {'Number': '361'},
 {'Number': '376'},
 {'Number': '308'},
 {'Number': '281'},
 {'Number': '307'},
 {'Number': '263'},
 {'Number': '274'},
 {'Number': '235'},
 {'Number': '230'},
 {'Number': '249'},
 {'Number': '231'},
 {'Number': '192'},
 {'Number': '159'},
 {'Number': '172'},
 {'Number': '167'},
 {'Number': '152'},
 {'Number': '157'},
 {'Number': '149'},
 {'Number': '135'},
 {'Number': '108'},
 {'Number': '125'},
 {'Number': '125'},
 {'Number': '128'},
 {'Number': '97'},
 {'Number': '92'},
 {'Number': '80'},
 {'Number': '107'},
 {'Number': '68'},
 {'Number': '85'},
 {'Number': '84'},
 {'Number': '95'},
 {'Number': '87'},
 {'Number': '66'},
 {'Number': '68'},
 {'Number': '55'},
 {'Number': '47'},
 {'Number': '44'},
 {'Number': '30'},
 {'Number': '30'},
 {'Number': '18'},
 {'Number': '27'},
 {'Number': '24'},
 {'Number': '17'},
 {'Number': '9'},
 {'Number': '7'},
 {'Number': '10'},
 {'Number': '214'},
 {'Number': '209'},
 {'Number': '191'},
 {'Number': '196'},
 {'Number': '223'},
 {'Number': '232'},
 {'Number': '214'},
 {'Number': '189'},
 {'Number': '204'},
 {'Number': '178'},
 {'Number': '207'},
 {'Number': '180'},
 {'Number': '159'},
 {'Number': '186'},
 {'Number': '161'},
 {'Number': '159'},
 {'Number': '150'},
 {'Number': '167'},
 {'Number': '161'},
 {'Number': '173'},
 {'Number': '201'},
 {'Number': '236'},
 {'Number': '259'},
 {'Number': '310'},
 {'Number': '368'},
 {'Number': '412'},
 {'Number': '472'},
 {'Number': '477'},
 {'Number': '495'},
 {'Number': '470'},
 {'Number': '448'},
 {'Number': '450'},
 {'Number': '513'},
 {'Number': '427'},
 {'Number': '394'},
 {'Number': '442'},
 {'Number': '468'},
 {'Number': '420'},
 {'Number': '371'},
 {'Number': '417'},
 {'Number': '349'},
 {'Number': '341'},
 {'Number': '358'},
 {'Number': '355'},
 {'Number': '365'},
 {'Number': '327'},
 {'Number': '323'},
 {'Number': '324'},
 {'Number': '292'},
 {'Number': '277'},
 {'Number': '279'},
 {'Number': '284'},
 {'Number': '277'},
 {'Number': '253'},
 {'Number': '251'},
 {'Number': '237'},
 {'Number': '245'},
 {'Number': '208'},
 {'Number': '220'},
 {'Number': '207'},
 {'Number': '187'},
 {'Number': '207'},
 {'Number': '168'},
 {'Number': '185'},
 {'Number': '141'},
 {'Number': '151'},
 {'Number': '170'},
 {'Number': '139'},
 {'Number': '160'},
 {'Number': '157'},
 {'Number': '127'},
 {'Number': '145'},
 {'Number': '119'},
 {'Number': '128'},
 {'Number': '112'},
 {'Number': '119'},
 {'Number': '136'},
 {'Number': '82'},
 {'Number': '105'},
 {'Number': '114'},
 {'Number': '124'},
 {'Number': '128'},
 {'Number': '104'},
 {'Number': '124'},
 {'Number': '120'},
 {'Number': '98'},
 {'Number': '89'},
 {'Number': '100'},
 {'Number': '90'},
 {'Number': '81'},
 {'Number': '70'},
 {'Number': '65'},
 {'Number': '51'},
 {'Number': '38'},
 {'Number': '22'},
 {'Number': '75'}]

In [61]:
saludo = [{"Hola": 15}, {"Adios": 20}]

In [73]:
valores = []
for x in saludo:
    valores.append(x.values())

print(sum(valores))

TypeError: unsupported operand type(s) for +: 'int' and 'dict_values'

In [ ]:
#iterar por cada nombre de barrio para que se sumen los number y se eliminen las columnas de edad y de género

## 2.2. Immigrants

In [23]:
immigrants = db["Immigrants"]

In [25]:
df_imm = pd.read_csv("../data/immigrants_by_nationality.csv")

In [26]:
df_imm.head()

,Year,District Code,District Name,Neighborhood Code,Neighborhood Name,Nationality,Number
0,2017,1,Ciutat Vella,1,el Raval,Spain,1109
1,2017,1,Ciutat Vella,2,el Barri Gòtic,Spain,482
2,2017,1,Ciutat Vella,3,la Barceloneta,Spain,414
3,2017,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Spain,537
4,2017,2,Eixample,5,el Fort Pienc,Spain,663

In [27]:
df_imm.shape

(35224, 7)

In [28]:
df_imm.dtypes

Year                  int64
District Code         int64
District Name        object
Neighborhood Code     int64
Neighborhood Name    object
Nationality          object
Number                int64
dtype: object

In [29]:
df_imm.duplicated().sum()

0

In [30]:
df_imm.isna().sum()

Year                 0
District Code        0
District Name        0
Neighborhood Code    0
Neighborhood Name    0
Nationality          0
Number               0
dtype: int64

In [31]:
df_imm.describe(exclude = "number")

       District Name Neighborhood Name Nationality
count          35224             35224       35224
unique            11                74         177
top       Nou Barris          el Raval       Spain
freq            6188               476         222

Hay un distrito y un barrio más que en los datos de población-> investigar 'No consta'

In [32]:
df_imm["District Name"].value_counts()

Nou Barris             6188
Horta-Guinardó         5236
Sant Martí             4760
Sants-Montjuïc         3808
Sant Andreu            3332
Eixample               2856
Sarrià-Sant Gervasi    2856
Gràcia                 2380
Ciutat Vella           1904
Les Corts              1428
No consta               476
Name: District Name, dtype: int64

In [33]:
df_imm["Neighborhood Name"].value_counts()

el Raval                                 476
Vallbona                                 476
Torre Baró                               476
la Trinitat Nova                         476
la Prosperitat                           476
                                        ...
Sant Gervasi - la Bonanova               476
les Tres Torres                          476
Sarrià                                   476
Vallvidrera, el Tibidabo i les Planes    476
No consta                                476
Name: Neighborhood Name, Length: 74, dtype: int64

In [34]:
df_imm["Nationality"].value_counts()

Spain              222
Macedonia          222
Iceland            222
Libya              222
Thailand           222
                  ...
Chad                74
Solomon Islands     74
Botswana            74
Laos                74
Taiwan              74
Name: Nationality, Length: 177, dtype: int64

In [35]:
df_imm.describe()

               Year  District Code  Neighborhood Code        Number
count  35224.000000   35224.000000       35224.000000  35224.000000
mean    2016.010504       7.500000          37.837838      7.707273
std        0.810846      11.061717          22.119174     50.421883
min     2015.000000       1.000000           1.000000      0.000000
25%     2015.000000       4.000000          19.000000      0.000000
50%     2016.000000       7.000000          37.500000      0.000000
75%     2017.000000       8.000000          56.000000      2.000000
max     2017.000000      99.000000          99.000000   1603.000000

In [36]:
df_imm["Year"].value_counts()

2016    12062
2017    11766
2015    11396
Name: Year, dtype: int64

## 2.3. Unemployment

In [37]:
unemployment = db["Unemployment"]

In [39]:
df_unem = pd.read_csv("../data/unemployment.csv")

In [40]:
df_unem.head()

,Year,Month,District Code,District Name,Neighborhood Code,Neighborhood Name,Gender,Demand_occupation,Number
0,2017,January,1,Ciutat Vella,1,el Raval,Male,Registered unemployed,2107
1,2017,January,1,Ciutat Vella,2,el Barri Gòtic,Male,Registered unemployed,538
2,2017,January,1,Ciutat Vella,3,la Barceloneta,Male,Registered unemployed,537
3,2017,January,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Male,Registered unemployed,741
4,2017,January,2,Eixample,5,el Fort Pienc,Male,Registered unemployed,630

In [41]:
df_unem.shape

(14208, 9)

In [42]:
df_unem.dtypes

Year                  int64
Month                object
District Code         int64
District Name        object
Neighborhood Code     int64
Neighborhood Name    object
Gender               object
Demand_occupation    object
Number                int64
dtype: object

In [43]:
df_unem.duplicated().sum()

0

In [44]:
df_unem.isna().sum()

Year                 0
Month                0
District Code        0
District Name        0
Neighborhood Code    0
Neighborhood Name    0
Gender               0
Demand_occupation    0
Number               0
dtype: int64

In [45]:
df_unem.describe(exclude = "number")

          Month District Name Neighborhood Name Gender      Demand_occupation
count     14208         14208             14208  14208                  14208
unique       12            11                74      2                      2
top     January    Nou Barris          el Raval   Male  Registered unemployed
freq       1184          2496               192   7104                   8880

In [46]:
df_unem["District Name"].value_counts()

Nou Barris             2496
Horta-Guinardó         2112
Sant Martí             1920
Sants-Montjuïc         1536
Sant Andreu            1344
Eixample               1152
Sarrià-Sant Gervasi    1152
Gràcia                  960
Ciutat Vella            768
Les Corts               576
No consta               192
Name: District Name, dtype: int64

In [47]:
df_unem["Neighborhood Name"].value_counts()

el Raval                                 192
Vallbona                                 192
Torre Baró                               192
la Trinitat Nova                         192
la Prosperitat                           192
                                        ...
Sant Gervasi - la Bonanova               192
les Tres Torres                          192
Sarrià                                   192
Vallvidrera, el Tibidabo i les Planes    192
No consta                                192
Name: Neighborhood Name, Length: 74, dtype: int64

In [48]:
df_unem["Demand_occupation"].value_counts()

Registered unemployed    8880
Unemployment demand      5328
Name: Demand_occupation, dtype: int64

In [49]:
df_unem.describe()

               Year  District Code  Neighborhood Code        Number
count  14208.000000   14208.000000       14208.000000  14208.000000
mean    2015.375000       7.500000          37.837838    446.701506
std        1.317003      11.061949          22.119639    425.948449
min     2013.000000       1.000000           1.000000      0.000000
25%     2014.750000       4.000000          19.000000    121.000000
50%     2015.500000       7.000000          37.500000    296.000000
75%     2016.250000       8.000000          56.000000    685.000000
max     2017.000000      99.000000          99.000000   3094.000000

In [50]:
df_unem["Year"].value_counts()

2017    3552
2016    3552
2015    3552
2014    1776
2013    1776
Name: Year, dtype: int64